import React from 'react';

const Description = () => {
  return (
    <div className="description">
      <h2>Описание проекта</h2>
      <p>
        Это мой первый проект на React. Я учусь создавать компоненты, управлять состоянием и использовать различные React-хуки.
        В этом проекте я реализую функциональность, позволяющую работать с постами: добавлять, удалять и сортировать их.
      </p>
      <p>
        Также я добавляю стилизацию компонентов и анимации, чтобы сделать приложение более привлекательным и интерактивным.
        Надеюсь, что этот проект поможет мне лучше понять основы React и веб-разработки в целом.
      </p>
    </div>
  );
};

export default Description;
